In [2]:
import pandas as pd

### Reading a csv file

In [28]:
file = "result.csv"
df = pd.read_csv(file)
df.head()

,ID,0,1,2,3,4,5,6,7,8,...,f7,f8,f9,fa,fb,fc,fd,fe,ff,??
0,01azqd4InC7m9JpocGv5.txt,601905,3905,2816,3832,3345,3242,3650,3201,2965,...,2804,3687,3101,3211,3097,2758,3099,2759,5753,1824
1,01IsoiSMh5gxyDYTl4CB.txt,39755,8337,7249,7186,8663,6844,8420,7589,9291,...,451,6536,439,281,302,7639,518,17001,54902,8588
2,01jsnpXSAlgw6aPeDxrU.txt,93506,9542,2568,2438,8925,9330,9007,2342,9107,...,2325,2358,2242,2885,2863,2471,2786,2680,49144,468
3,01kcPWA9K2BOxQeS5Rju.txt,21091,1213,726,817,1257,625,550,523,1078,...,478,873,485,462,516,1133,471,761,7998,13940
4,01SuzwMJEIXsK7A8dQbl.txt,19764,710,302,433,559,410,262,249,422,...,847,947,350,209,239,653,221,242,2199,9008

In [30]:
# changing delimeter
symbol = "|"
df = pd.read_csv(file,sep = symbol)
#df.head()

### saving dataframe to csv file

In [31]:
df.to_csv(file)

In [32]:
file

'result.csv'

In [33]:
print(df.to_csv(file))

None

In [35]:
print(file)

result.csv

### creating a dataframe from list

In [36]:
data = [[1,2,3],
        [4,5,6]]

In [37]:
df = pd.DataFrame(data,columns = ["A","B","C"])
df

   A  B  C
0  1  2  3
1  4  5  6

In [38]:
data = {"A":[1,2],"B":[3,4],"C":[5,6]}
df = pd.DataFrame(data)
df

   A  B  C
0  1  3  5
1  2  4  6

### Merging two data frames

In [39]:
df1 = pd.DataFrame([[1,"A"],
                    [2,"B"],
                  [3,"C"],
                  [4,"D"]],
                 columns = ["col1","col2"])
df1

   col1 col2
0     1    A
1     2    B
2     3    C
3     4    D

In [41]:
df2 = pd.DataFrame([["A",1],
                    ["B",2],
                  ["C",3],
                  ["D",4]],
                 columns = ["col2","col3"])
df2

  col2  col3
0    A     1
1    B     2
2    C     3
3    D     4

In [42]:
pd.merge(df1,df2,on = "col2",how = "inner")

   col1 col2  col3
0     1    A     1
1     2    B     2
2     3    C     3
3     4    D     4

### sorting a data frame

In [3]:
df = pd.DataFrame([[3,"A"],
                    [2,"B"],
                  [1,"D"],
                  [0,"C"]],
                 columns = ["col1","col2"])
df

   col1 col2
0     3    A
1     2    B
2     1    D
3     0    C

In [4]:
df.sort_values(by = 'col1')

   col1 col2
3     0    C
2     1    D
1     2    B
0     3    A

In [16]:
sorted_df = df.sort_values(by = 'col1',ascending = True)
sorted_df

   col1 col2
3     0    C
2     1    D
1     2    B
0     3    A

In [10]:
sorted_df = df.sort_values(by = 'col1',inplace = True)

In [11]:
sorted_df.head(2)

AttributeError: 'NoneType' object has no attribute 'head'

In [46]:
df.sort_values(by = 'col2')

   col1 col2
0     3    A
1     2    B
3     0    C
2     1    D

### concatenate dataframes

In [47]:
df1 = pd.DataFrame([[1,"A"],
                    [2,"B"],
                  [3,"C"],
                  [4,"D"]],
                 columns = ["col1","col2"])
df1

   col1 col2
0     1    A
1     2    B
2     3    C
3     4    D

In [51]:
df2 = pd.DataFrame([["A",1],
                    ["B",2],
                  ["C",3],
                  ["D",4]],
                 columns = ["col3","col4"])
df2

  col3  col4
0    A     1
1    B     2
2    C     3
3    D     4

In [52]:
pd.concat((df1,df2),axis = 1)

   col1 col2 col3  col4
0     1    A    A     1
1     2    B    B     2
2     3    C    C     3
3     4    D    D     4

### Rename columns

In [53]:
df = pd.DataFrame([[1,"A"],
                    [2,"B"],
                  [3,"D"],
                  [4,"C"]],
                 columns = ["col1","col2"])
df

   col1 col2
0     1    A
1     2    B
2     3    D
3     4    C

In [54]:
df.rename(columns = {"col1":"col3","col2":"col4"})

   col3 col4
0     1    A
1     2    B
2     3    D
3     4    C

### Add a new column

In [55]:
df["col3"]=df['col1']+2
df

   col1 col2  col3
0     1    A     3
1     2    B     4
2     3    D     5
3     4    C     6

In [ ]:
df = pd.DataFrame([[1,"A"],
                    [2,"B"],
                  [2,"D"],
                  [4,"C"]],
                 columns = ["col1","col2"])
df

In [57]:
df[df.col1>1]

   col1 col2  col3
1     2    B     4
2     3    D     5
3     4    C     6

In [59]:
df[df.col1==2]

   col1 col2  col3
1     2    B     4

### filter from list

In [60]:
filter_list = [1,2]
df[df.col1.isin(filter_list)]

   col1 col2  col3
0     1    A     3
1     2    B     4

### Drop columns

In [62]:
df

   col1 col2  col3
0     1    A     3
1     2    B     4
2     3    D     5
3     4    C     6

In [63]:
df.drop(columns = ["col3"])

   col1 col2
0     1    A
1     2    B
2     3    D
3     4    C

### Groupby

In [2]:
df = pd.DataFrame([[1,"A"],
                    [2,"B"],
                  [3,"A"],
                  [4,"C"]],
                 columns = ["col1","col2"])

In [3]:
df

   col1 col2
0     1    A
1     2    B
2     3    A
3     4    C

In [4]:
df.groupby("col2").col1.sum()

col2
A    4
B    2
C    4
Name: col1, dtype: int64

In [8]:
df

   col1 col2  col3
0     1    A     3
1     2    B     4
2     3    A     5
3     4    C     6

In [9]:
df.col2.unique()  # unique values

array(['A', 'B', 'C'], dtype=object)

In [10]:
df.col2.nunique() # no of unique values

3

In [12]:
import numpy as np
# Fill null values
df = pd.DataFrame([[1,"A"],
                    [2,np.nan],
                  [3,"A"],
                  [4,np.nan]],
                 columns = ["col1","col2"])

In [13]:
df

   col1 col2
0     1    A
1     2  NaN
2     3    A
3     4  NaN

In [14]:
df.col2.fillna("B",inplace = True)

In [15]:
df

   col1 col2
0     1    A
1     2    B
2     3    A
3     4    B

### Apply a function

In [16]:
def f(number):
    return number + 2

df = pd.DataFrame([[1,"A"],
                    [2,"B"],
                  [3,"C"],
                  [4,"D"]],
                 columns = ["col1","col2"])
df["col3"]=df.col1.apply(f)

In [17]:
df

   col1 col2  col3
0     1    A     3
1     2    B     4
2     3    C     5
3     4    D     6

### Drop duplicatyes

In [20]:
df = pd.DataFrame([[1,"A"],
                    [2,"B"],
                  [1,"A"],
                  [2,"B"]],
                 columns = ["col1","col2"])

In [21]:
df.drop_duplicates()

   col1 col2
0     1    A
1     2    B

### value_counts

In [22]:
df = pd.DataFrame([[1,"A"],
                    [2,"B"],
                  [3,"A"],
                  [4,"B"]],
                 columns = ["col1","col2"])
df

   col1 col2
0     1    A
1     2    B
2     3    A
3     4    B

In [23]:
df.col2.value_counts()

B    2
A    2
Name: col2, dtype: int64

### Dataframe size

In [24]:
df.shape

(4, 2)